Ракович_В_Ю_70189466/src/Documents/МедОсмотр/МедОсмотр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МедОсмотр</name>
  <basedOn>Catalog.ПоказателиЗдоровья</basedOn>
  <registerRecords>AccumulationRegister.ИсторияПоказателейЗдоровья</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОсмотра</name>
    <type>
      <types>CatalogRef.ТипыМедОсмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>МедРаботник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Кабинет</name>
    <type>
      <types>CatalogRef.КабинетыМедПункта</types>
    </type>
  </attributes>
  <attributes>
    <name>Рост</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АртериальноеДавление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пульс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заключение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЗдоровья</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиЗдоровья</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Ракович_В_Ю_70189466/src/Documents/Вакцинация/Вакцинация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Вакцинация</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Врач</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Прививка</name>
    <type>
      <types>CatalogRef.Прививки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВакцинации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дозировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Ракович_В_Ю_70189466/src/CommonModules/РаботаСЗдоровьем/Module.bsl
// Экспортная функция получения текущего пользователя
Функция ПолучитьТекущегоПользователя() Экспорт
    
    Возврат ПараметрыСеанса.ТекущийПользователь;
    
КонецФункции

// Получение текущего учебного года
Функция ПолучитьТекущийУчебныйГод() Экспорт
    
    Возврат Константы.ТекущийУчебныйГод.Получить();
    
КонецФункции

// Расчет возраста по дате рождения
Функция РассчитатьВозраст(ДатаРождения) Экспорт
    
    Если Не ЗначениеЗаполнено(ДатаРождения) Тогда
        Возврат 0;
    КонецЕсли;
    
    ТекГод = Год(ТекущаяДата());
    ГодРождения = Год(ДатаРождения);
    
    Возраст = ТекГод - ГодРождения;
    
    // Корректировка если день рождения еще не наступил
    Если Месяц(ТекущаяДата()) < Месяц(ДатаРождения) Или 
       (Месяц(ТекущаяДата()) = Месяц(ДатаРождения) И 
        День(ТекущаяДата()) < День(ДатаРождения)) Тогда
        Возраст = Возраст - 1;
    КонецЕсли;
    
    Возврат Возраст;
    
КонецФункции

// Расчет ИМТ
Функция РассчитатьИМТ(РостВМетрах, ВесВКилограммах) Экспорт
    
    Если РостВМетрах <= 0 Или ВесВКилограммах <= 0 Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Возврат ВесВКилограммах / (РостВМетрах * РостВМетрах);
    
КонецФункции

// Определение группы здоровья по ИМТ
Функция ОпределитьГруппуЗдоровьяПоИМТ(ИМТ, Возраст) Экспорт
    
    Если ИМТ = Неопределено Тогда
        Возврат "Не определено";
    КонецЕсли;
    
    // Нормы для взрослых
    Если Возраст >= 18 Тогда
        Если ИМТ < 18.5 Тогда
            Возврат "Недостаточный вес";
        ИначеЕсли ИМТ >= 18.5 И ИМТ <= 24.9 Тогда
            Возврат "Норма";
        ИначеЕсли ИМТ >= 25 И ИМТ <= 29.9 Тогда
            Возврат "Избыточный вес";
        Иначе
            Возврат "Ожирение";
        КонецЕсли;
    КонецЕсли;
    
    Возврат "Не определено";
    
КонецФункции

// Проверка показателя на соответствие норме
Функция ПроверитьПоказательНаНорму(ЗначениеПоказателя, НормаМин, НормаМакс) Экспорт
    
    Если Не ЗначениеЗаполнено(ЗначениеПоказателя) Тогда
        Возврат "Не измерен";
    КонецЕсли;
    
    Если ЗначениеПоказателя < НормаМин Тогда
        Возврат "Ниже нормы";
    ИначеЕсли ЗначениеПоказателя > НормаМакс Тогда
        Возврат "Выше нормы";
    Иначе
        Возврат "В норме";
    КонецЕсли;
    
КонецФункции

// Получить историю здоровья студента
Функция ПолучитьИсториюЗдоровьяСтудента(Студент, ДатаНачала, ДатаОкончания) Экспорт
    
    Результат = Новый Структура();
    
    // Медосмотры
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    МедОсмотр.Дата,
    |    МедОсмотр.Ссылка,
    |    'Медосмотр' КАК ТипСобытия,
    |    МедОсмотр.Заключение КАК Описание
    |ИЗ
    |    Документ.МедОсмотр КАК МедОсмотр
    |ГДЕ
    |    МедОсмотр.Студент = &Студент
    |    И МедОсмотр.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |    ЗаболеваниеСтудента.ДатаНачала,
    |    ЗаболеваниеСтудента.Ссылка,
    |    'Заболевание',
    |    ЗаболеваниеСтудента.Диагноз
    |ИЗ
    |    Документ.ЗаболеваниеСтудента КАК ЗаболеваниеСтудента
    |ГДЕ
    |    ЗаболеваниеСтудента.Студент = &Студент
    |    И ЗаболеваниеСтудента.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |    Вакцинация.Дата,
    |    Вакцинация.Ссылка,
    |    'Вакцинация',
    |    Вакцинация.Прививка.Наименование
    |ИЗ
    |    Документ.Вакцинация КАК Вакцинация
    |ГДЕ
    |    Вакцинация.Студент = &Студент
    |    И Вакцинация.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
    |
    |УПОРЯДОЧИТЬ ПО
    |    Дата УБЫВ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    
    Результат.Вставить("История", Запрос.Выполнить().Выгрузить());
    
    // Показатели здоровья
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ИсторияПоказателейЗдоровья.ПериодИзмерения,
    |    ИсторияПоказателейЗдоровья.Показатель.Наименование,
    |    ИсторияПоказателейЗдоровья.Значение,
    |    ИсторияПоказателейЗдоровья.ЕдиницаИзмерения
    |ИЗ
    |    РегистрНакопления.ИсторияПоказателейЗдоровья КАК ИсторияПоказателейЗдоровья
    |ГДЕ
    |    ИсторияПоказателейЗдоровья.Студент = &Студент
    |    И ИсторияПоказателейЗдоровья.ПериодИзмерения МЕЖДУ &ДатаНачала И &ДатаОкончания
    |УПОРЯДОЧИТЬ ПО
    |    ИсторияПоказателейЗдоровья.ПериодИзмерения УБЫВ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    
    Результат.Вставить("Показатели", Запрос.Выполнить().Выгрузить());
    
    Возврат Результат;
    
КонецФункции
